RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_CherryUSB/Edgi_Talk_Extend_Screen/applications/usb_display/usb_display.c
/*
 * USB Display application - adapted from CherryUSB demo/display/usbdisplay_template.c
 *
 * Uses the usbd_display class driver with mempool-based buffering.
 * Receives frames from the Windows xfz1986_usb_graphic driver and renders
 * them to the on-board LCD via Cy_GFXSS interfaces.
 */
#include <string.h>
#include <rtthread.h>
#include <rtdevice.h>
#include <board.h>
#include <drivers/touch.h>
#include "cy_graphics.h"
#include <display_tl043wvv02.h>

#include "usb_display.h"
#include "usb_config.h"
#include "usbd_core.h"
#include "usbd_display.h"
#include "usbd_hid.h"
#include "drv_touch.h"

#define USB_DISPLAY_BUSID 0

#ifndef USBHS_BASE
#define USBHS_BASE 0x44900000UL
#endif

#define DISPLAY_IN_EP  0x81
#define DISPLAY_OUT_EP 0x02
#define HID_TOUCH_IN_EP 0x83

#define HID_TOUCH_EP_MPS      8
#define HID_TOUCH_EP_INTERVAL 1

#ifdef CONFIG_USB_HS
#define DISPLAY_EP_MPS 512
#else
#define DISPLAY_EP_MPS 64
#endif

#define USBD_VID           0x303A
#define USBD_PID           0x2986
#define USBD_MAX_POWER     100
#define USBD_LANGID_STRING 1033

#define USB_CONFIG_SIZE (9 + 9 + 7 + 7 + 9 + 9 + 7)

#ifndef USB_DISPLAY_LOG_ENABLE
#define USB_DISPLAY_LOG_ENABLE 1
#endif

#if USB_DISPLAY_LOG_ENABLE
#define USB_DISPLAY_LOG(...) rt_kprintf(__VA_ARGS__)
#else
#define USB_DISPLAY_LOG(...)
#endif

/* ---------- Display parameters ---------- */
#define USB_DISPLAY_MAX_WIDTH  480U
#define USB_DISPLAY_MAX_HEIGHT 800U
#define USB_DISPLAY_RX_FRAME_BYTES  (USB_DISPLAY_MAX_WIDTH * USB_DISPLAY_MAX_HEIGHT * 2U)
#define USB_DISPLAY_LCD_STRIDE 512U
#define USB_DISPLAY_FB_STRIDE_BYTES (USB_DISPLAY_LCD_STRIDE * 2U)
#define USB_DISPLAY_GPU_FRAME_BYTES (USB_DISPLAY_LCD_STRIDE * USB_DISPLAY_MAX_HEIGHT * 2U)
#define USB_TOUCH_LOGICAL_MAX_X (USB_DISPLAY_MAX_WIDTH - 1U)
#define USB_TOUCH_LOGICAL_MAX_Y (USB_DISPLAY_MAX_HEIGHT - 1U)
#define HID_TOUCH_REPORT_DESC_SIZE 74

#define USB_TOUCH_DEV_NAME "ST7102"
#define USB_TOUCH_POLL_MS  10
#define USB_TOUCH_DEBOUNCE_DOWN 2
#define USB_TOUCH_DEBOUNCE_UP   2
#define USB_TOUCH_JITTER_PIXELS 3

/*
 * Product string encodes the resolution and format for the Windows driver.
 * Format: cherryusb_R<W>x<H>_E<fmt>_Fps<fps>_Bl<blocksize>
 *   fmt: rgb16 = RGB565, jpg9 = JPEG
 */
#define USB_DISPLAY_PRODUCT_STRING "cherryusb_R480x800_Ergb16_Fps30_Bl128"

#define DISPLAY_RESET_PORT GPIO_PRT20
#define DISPLAY_RESET_PIN  (7U)

#define USB_DISPLAY_BL_PWM_DEV_NAME      "pwm18"
#define USB_DISPLAY_BL_PWM_CHANNEL       0
#define USB_DISPLAY_BL_PWM_PERIOD_NS     200000
#define USB_DISPLAY_BL_DEFAULT_BRIGHTNESS 80

/* ---------- LCD related ---------- */
static uint8_t *framebuffer;
static rt_thread_t display_thread;
static uint32_t fb_stride_bytes;
static uint16_t usb_frame_width;
static uint16_t usb_frame_height;

static GFXSS_Type *gfxbase = (GFXSS_Type *)GFXSS;
static cy_stc_gfx_context_t usb_display_gfx_context;
static uint8_t *gpu_present_buffer;
static uint8_t *gpu_draw_buffer;

static cy_stc_sysint_t usb_display_dc_irq_cfg = {
    .intrSrc = GFXSS_DC_IRQ,
    .intrPriority = 3U,
};

#ifdef RT_USING_PWM
static struct rt_device_pwm *usb_display_bl_pwm;
#endif

static rt_bool_t usb_display_hw_inited;

static uint32_t gui_frame_count;
static uint32_t gui_frame_count_last;
static rt_tick_t gui_fps_last_tick;

static rt_bool_t pending_frame_valid;
static uint16_t pending_frame_id;
static rt_tick_t pending_last_tick;

/* ---------- USB descriptor ---------- */
static const uint8_t device_descriptor[] = {
    USB_DEVICE_DESCRIPTOR_INIT(USB_2_0, 0x00, 0x00, 0x00, USBD_VID, USBD_PID, 0x0101, 0x01)
};

static const uint8_t hid_touch_report_desc[HID_TOUCH_REPORT_DESC_SIZE] = {
    0x05, 0x0D, /* USAGE_PAGE (Digitizers) */
    0x09, 0x04, /* USAGE (Touch Screen) */
    0xA1, 0x01, /* COLLECTION (Application) */
    0x09, 0x22, /*   USAGE (Finger) */
    0xA1, 0x02, /*   COLLECTION (Logical) */
    0x09, 0x42, /*     USAGE (Tip Switch) */
    0x09, 0x32, /*     USAGE (In Range) */
    0x15, 0x00, /*     LOGICAL_MINIMUM (0) */
    0x25, 0x01, /*     LOGICAL_MAXIMUM (1) */
    0x75, 0x01, /*     REPORT_SIZE (1) */
    0x95, 0x02, /*     REPORT_COUNT (2) */
    0x81, 0x02, /*     INPUT (Data,Var,Abs) */
    0x75, 0x06, /*     REPORT_SIZE (6) */
    0x95, 0x01, /*     REPORT_COUNT (1) */
    0x81, 0x03, /*     INPUT (Cnst,Var,Abs) */
    0x05, 0x01, /*     USAGE_PAGE (Generic Desktop) */
    0x09, 0x30, /*     USAGE (X) */
    0x15, 0x00, /*     LOGICAL_MINIMUM (0) */
    0x26, WBVAL(USB_TOUCH_LOGICAL_MAX_X), /* LOGICAL_MAXIMUM (X) */
    0x75, 0x10, /*     REPORT_SIZE (16) */
    0x95, 0x01, /*     REPORT_COUNT (1) */
    0x81, 0x02, /*     INPUT (Data,Var,Abs) */
    0x09, 0x31, /*     USAGE (Y) */
    0x15, 0x00, /*     LOGICAL_MINIMUM (0) */
    0x26, WBVAL(USB_TOUCH_LOGICAL_MAX_Y), /* LOGICAL_MAXIMUM (Y) */
    0x75, 0x10, /*     REPORT_SIZE (16) */
    0x95, 0x01, /*     REPORT_COUNT (1) */
    0x81, 0x02, /*     INPUT (Data,Var,Abs) */
    0xC0,       /*   END_COLLECTION */
    0x05, 0x0D, /*   USAGE_PAGE (Digitizers) */
    0x09, 0x54, /*   USAGE (Contact Count) */
    0x15, 0x00, /*   LOGICAL_MINIMUM (0) */
    0x25, 0x01, /*   LOGICAL_MAXIMUM (1) */
    0x75, 0x08, /*   REPORT_SIZE (8) */
    0x95, 0x01, /*   REPORT_COUNT (1) */
    0x81, 0x02, /*   INPUT (Data,Var,Abs) */
    0xC0        /* END_COLLECTION */
};

static const uint8_t config_descriptor[] = {
    USB_CONFIG_DESCRIPTOR_INIT(USB_CONFIG_SIZE, 0x02, 0x01, USB_CONFIG_BUS_POWERED, USBD_MAX_POWER),
    USB_INTERFACE_DESCRIPTOR_INIT(0x00, 0x00, 0x02, 0xff, 0x00, 0x00, 0x00),
    USB_ENDPOINT_DESCRIPTOR_INIT(DISPLAY_IN_EP, 0x02, DISPLAY_EP_MPS, 0x00),
    USB_ENDPOINT_DESCRIPTOR_INIT(DISPLAY_OUT_EP, 0x02, DISPLAY_EP_MPS, 0x00),
    0x09,
    USB_DESCRIPTOR_TYPE_INTERFACE,
    0x01,
    0x00,
    0x01,
    0x03,
    0x00,
    0x00,
    0x00,
    0x09,
    HID_DESCRIPTOR_TYPE_HID,
    0x11,
    0x01,
    0x00,
    0x01,
    HID_DESCRIPTOR_TYPE_HID_REPORT,
    WBVAL(HID_TOUCH_REPORT_DESC_SIZE),
    0x07,
    USB_DESCRIPTOR_TYPE_ENDPOINT,
    HID_TOUCH_IN_EP,
    0x03,
    WBVAL(HID_TOUCH_EP_MPS),
    HID_TOUCH_EP_INTERVAL,
};

static const uint8_t device_quality_descriptor[] = {
    ///////////////////////////////////////
    /// device qualifier descriptor
    ///////////////////////////////////////
    0x0a,
    USB_DESCRIPTOR_TYPE_DEVICE_QUALIFIER,
    0x00,
    0x02,
    0x00,
    0x00,
    0x00,
    0x40,
    0x00,
    0x00,
};

static const char *string_descriptors[] = {
    (const char[]){ 0x09, 0x04 },            /* Langid */
    "Edgi-talk",                             /* Manufacturer */
    USB_DISPLAY_PRODUCT_STRING,              /* Product - encodes resolution/format */
    "20260210",                              /* Serial Number */
};

