RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_CherryUSB/Edgi_Talk_Extend_Screen/applications/usb_display/usb_display.c
static const uint8_t *device_descriptor_callback(uint8_t speed)
{
    (void)speed;
    return device_descriptor;
}

static const uint8_t *config_descriptor_callback(uint8_t speed)
{
    (void)speed;
    return config_descriptor;
}

static const uint8_t *device_quality_descriptor_callback(uint8_t speed)
{
    (void)speed;
#ifdef CONFIG_USB_HS
    return device_quality_descriptor;
#else
    return RT_NULL;
#endif
}

static const char *string_descriptor_callback(uint8_t speed, uint8_t index)
{
    (void)speed;
    if (index >= (sizeof(string_descriptors) / sizeof(char *)))
    {
        return RT_NULL;
    }
    return string_descriptors[index];
}

static const struct usb_descriptor display_descriptor = {
    .device_descriptor_callback = device_descriptor_callback,
    .config_descriptor_callback = config_descriptor_callback,
    .device_quality_descriptor_callback = device_quality_descriptor_callback,
    .string_descriptor_callback = string_descriptor_callback
};

/* ---------- USB touch HID ---------- */
struct hid_touch_report {
    uint8_t tip_inrange;
    uint16_t x;
    uint16_t y;
    uint8_t contact_count;
} __PACKED;

#define HID_STATE_IDLE 0
#define HID_STATE_BUSY 1

static USB_NOCACHE_RAM_SECTION USB_MEM_ALIGNX struct hid_touch_report touch_report;
static volatile uint8_t hid_touch_state = HID_STATE_IDLE;

static rt_device_t touch_dev;
static struct rt_touch_info touch_info;
static rt_thread_t touch_thread;

static void usb_display_dc_irq_handler(void)
{
    rt_interrupt_enter();
    Cy_GFXSS_Clear_DC_Interrupt(gfxbase, &usb_display_gfx_context);
    rt_interrupt_leave();
}

#ifdef RT_USING_PWM
static rt_err_t usb_display_backlight_set(rt_uint8_t percent)
{
    rt_uint32_t pulse;

    if (percent > 100U)
    {
        percent = 100U;
    }

    if (usb_display_bl_pwm == RT_NULL)
    {
        usb_display_bl_pwm = (struct rt_device_pwm *)rt_device_find(USB_DISPLAY_BL_PWM_DEV_NAME);
        if (usb_display_bl_pwm == RT_NULL)
        {
            USB_DISPLAY_LOG("usb_display: cannot find %s\r\n", USB_DISPLAY_BL_PWM_DEV_NAME);
            return -RT_ENOSYS;
        }

        rt_pwm_enable(usb_display_bl_pwm, USB_DISPLAY_BL_PWM_CHANNEL);
    }

    pulse = (USB_DISPLAY_BL_PWM_PERIOD_NS * percent) / 100U;
    rt_pwm_set(usb_display_bl_pwm,
               USB_DISPLAY_BL_PWM_CHANNEL,
               USB_DISPLAY_BL_PWM_PERIOD_NS,
               pulse);
    return RT_EOK;
}
#endif

static rt_err_t usb_display_hw_init(void)
{
    cy_en_gfx_status_t gfx_status;
    cy_en_sysint_status_t int_status;
    cy_en_mipidsi_status_t mipi_status;
    mtb_display_tl043wvv02_pin_config_t panel_pin_cfg = {
        .reset_port = DISPLAY_RESET_PORT,
        .reset_pin = DISPLAY_RESET_PIN,
    };

    if (usb_display_hw_inited)
    {
        return RT_EOK;
    }

    gfx_status = Cy_GFXSS_Init(gfxbase, &GFXSS_config, &usb_display_gfx_context);
    if (gfx_status != CY_GFX_SUCCESS)
    {
        USB_DISPLAY_LOG("usb_display: Cy_GFXSS_Init failed: %u\r\n", (unsigned int)gfx_status);
        return -RT_ERROR;
    }

    int_status = Cy_SysInt_Init(&usb_display_dc_irq_cfg, usb_display_dc_irq_handler);
    if (int_status != CY_SYSINT_SUCCESS)
    {
        USB_DISPLAY_LOG("usb_display: register DC IRQ failed: %u\r\n", (unsigned int)int_status);
        return -RT_ERROR;
    }

    NVIC_EnableIRQ(GFXSS_DC_IRQ);

    mipi_status = mtb_display_tl043wvv02_init(GFXSS_GFXSS_MIPIDSI, &panel_pin_cfg);
    if (mipi_status != CY_MIPIDSI_SUCCESS)
    {
        USB_DISPLAY_LOG("usb_display: panel init failed: %u\r\n", (unsigned int)mipi_status);
        return -RT_ERROR;
    }

#ifdef RT_USING_PWM
    usb_display_backlight_set(USB_DISPLAY_BL_DEFAULT_BRIGHTNESS);
#endif

    usb_display_hw_inited = RT_TRUE;
    return RT_EOK;
}

static void usbd_event_handler(uint8_t busid, uint8_t event)
{
    switch (event)
    {
    case USBD_EVENT_RESET:
        break;
    case USBD_EVENT_CONNECTED:
        break;
    case USBD_EVENT_DISCONNECTED:
        break;
    case USBD_EVENT_RESUME:
        break;
    case USBD_EVENT_SUSPEND:
        break;
    case USBD_EVENT_CONFIGURED:
        hid_touch_state = HID_STATE_IDLE;
        break;
    case USBD_EVENT_SET_REMOTE_WAKEUP:
        break;
    case USBD_EVENT_CLR_REMOTE_WAKEUP:
        break;
    default:
        break;
    }
}

static void usbd_hid_touch_in_callback(uint8_t busid, uint8_t ep, uint32_t nbytes)
{
    (void)busid;
    (void)ep;
    (void)nbytes;
    hid_touch_state = HID_STATE_IDLE;
}

static struct usbd_endpoint hid_in_ep = {
    .ep_cb = usbd_hid_touch_in_callback,
    .ep_addr = HID_TOUCH_IN_EP
};

static void usb_touch_get_src_max(uint16_t *src_max_x, uint16_t *src_max_y)
{
    uint32_t lcd_w = (usb_frame_width > 0) ? usb_frame_width : USB_DISPLAY_MAX_WIDTH;
    uint32_t lcd_h = (usb_frame_height > 0) ? usb_frame_height : USB_DISPLAY_MAX_HEIGHT;
    uint32_t range_x = (uint32_t)touch_info.range_x;
    uint32_t range_y = (uint32_t)touch_info.range_y;
    rt_bool_t use_touch_range = RT_FALSE;

    if ((range_x > 0U) && (range_y > 0U))
    {
        if ((range_x <= (lcd_w * 2U)) && (range_x >= (lcd_w / 2U)) &&
            (range_y <= (lcd_h * 2U)) && (range_y >= (lcd_h / 2U)))
        {
            use_touch_range = RT_TRUE;
        }
    }

    if (use_touch_range)
    {
        *src_max_x = (range_x > 0U) ? (uint16_t)(range_x - 1U) : (uint16_t)(lcd_w - 1U);
        *src_max_y = (range_y > 0U) ? (uint16_t)(range_y - 1U) : (uint16_t)(lcd_h - 1U);
    }
    else
    {
        *src_max_x = (lcd_w > 0U) ? (uint16_t)(lcd_w - 1U) : (uint16_t)(USB_DISPLAY_MAX_WIDTH - 1U);
        *src_max_y = (lcd_h > 0U) ? (uint16_t)(lcd_h - 1U) : (uint16_t)(USB_DISPLAY_MAX_HEIGHT - 1U);
    }
}

static uint16_t usb_touch_scale_coord(rt_int32_t coord, uint16_t src_max, uint16_t logical_max)
{
    if (coord < 0)
    {
        coord = 0;
    }

    if (src_max == 0U)
    {
        return 0;
    }

    if ((uint32_t)coord > src_max)
    {
        coord = (rt_int32_t)src_max;
    }

    return (uint16_t)(((uint32_t)coord * (uint32_t)logical_max) / (uint32_t)src_max);
}

static rt_err_t usb_touch_open_device(void)
{
    touch_dev = rt_device_find(USB_TOUCH_DEV_NAME);
    if (touch_dev == RT_NULL)
    {
        if (rt_hw_ST7102_port() == RT_EOK)
        {
            touch_dev = rt_device_find(USB_TOUCH_DEV_NAME);
        }
    }

