RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_CherryUSB/Edgi_Talk_Extend_Screen/applications/usb_display/usb_display.c
    if (touch_dev == RT_NULL)
    {
        USB_DISPLAY_LOG("usb_touch: device %s not found\r\n", USB_TOUCH_DEV_NAME);
        return -RT_ERROR;
    }

    if (rt_device_open(touch_dev, RT_DEVICE_FLAG_INT_RX) != RT_EOK)
    {
        USB_DISPLAY_LOG("usb_touch: open device failed\r\n");
        return -RT_ERROR;
    }

    if (rt_device_control(touch_dev, RT_TOUCH_CTRL_GET_INFO, &touch_info) != RT_EOK)
    {
        rt_memset(&touch_info, 0, sizeof(touch_info));
    }

    return RT_EOK;
}

static void usb_touch_thread_entry(void *parameter)
{
    (void)parameter;
    struct rt_touch_data touch_data[1];
    rt_int16_t last_raw_x = 0;
    rt_int16_t last_raw_y = 0;
    rt_bool_t last_raw_pressed = RT_FALSE;
    rt_int16_t filtered_x = 0;
    rt_int16_t filtered_y = 0;
    rt_bool_t filtered_pressed = RT_FALSE;
    rt_uint8_t down_count = 0;
    rt_uint8_t up_count = 0;
    uint16_t src_max_x = 0;
    uint16_t src_max_y = 0;

    while (1)
    {
        if (touch_dev == RT_NULL)
        {
            rt_thread_mdelay(USB_TOUCH_POLL_MS);
            continue;
        }

        if (!usb_device_is_configured(USB_DISPLAY_BUSID))
        {
            rt_thread_mdelay(USB_TOUCH_POLL_MS);
            continue;
        }

        rt_memset(touch_data, 0, sizeof(touch_data));
        rt_size_t num = rt_device_read(touch_dev, 0, touch_data, 1);
        rt_bool_t raw_pressed = last_raw_pressed;
        rt_int16_t raw_x = last_raw_x;
        rt_int16_t raw_y = last_raw_y;

        if (num > 0)
        {
            if ((touch_data[0].event == RT_TOUCH_EVENT_DOWN) || (touch_data[0].event == RT_TOUCH_EVENT_MOVE))
            {
                raw_pressed = RT_TRUE;
                raw_x = touch_data[0].x_coordinate;
                raw_y = touch_data[0].y_coordinate;
            }
            else if (touch_data[0].event == RT_TOUCH_EVENT_UP)
            {
                raw_pressed = RT_FALSE;
                raw_x = touch_data[0].x_coordinate;
                raw_y = touch_data[0].y_coordinate;
            }
        }
        else if (last_raw_pressed)
        {
            raw_pressed = RT_FALSE;
        }

        if (raw_pressed)
        {
            if (down_count < 0xFF)
            {
                down_count++;
            }
            up_count = 0;
        }
        else
        {
            if (up_count < 0xFF)
            {
                up_count++;
            }
            down_count = 0;
        }

        if (!filtered_pressed)
        {
            if (raw_pressed && (down_count >= USB_TOUCH_DEBOUNCE_DOWN) && (hid_touch_state == HID_STATE_IDLE))
            {
                filtered_pressed = RT_TRUE;
                filtered_x = raw_x;
                filtered_y = raw_y;

                rt_int32_t map_x = filtered_x;
                rt_int32_t map_y = filtered_y;

                usb_touch_get_src_max(&src_max_x, &src_max_y);

                touch_report.tip_inrange = 0x03;
                touch_report.x = usb_touch_scale_coord(map_x, src_max_x, USB_TOUCH_LOGICAL_MAX_X);
                touch_report.y = usb_touch_scale_coord(map_y, src_max_y, USB_TOUCH_LOGICAL_MAX_Y);
                touch_report.contact_count = 1;

                hid_touch_state = HID_STATE_BUSY;
                int ret = usbd_ep_start_write(USB_DISPLAY_BUSID,
                                              HID_TOUCH_IN_EP,
                                              (uint8_t *)&touch_report,
                                              sizeof(touch_report));
                if (ret < 0)
                {
                    hid_touch_state = HID_STATE_IDLE;
                    filtered_pressed = RT_FALSE;
                }
            }
        }
        else
        {
            if (!raw_pressed && (up_count >= USB_TOUCH_DEBOUNCE_UP) && (hid_touch_state == HID_STATE_IDLE))
            {
                filtered_pressed = RT_FALSE;

                rt_int32_t map_x = filtered_x;
                rt_int32_t map_y = filtered_y;

                usb_touch_get_src_max(&src_max_x, &src_max_y);

                touch_report.tip_inrange = 0x00;
                touch_report.x = usb_touch_scale_coord(map_x, src_max_x, USB_TOUCH_LOGICAL_MAX_X);
                touch_report.y = usb_touch_scale_coord(map_y, src_max_y, USB_TOUCH_LOGICAL_MAX_Y);
                touch_report.contact_count = 0;

                hid_touch_state = HID_STATE_BUSY;
                int ret = usbd_ep_start_write(USB_DISPLAY_BUSID,
                                              HID_TOUCH_IN_EP,
                                              (uint8_t *)&touch_report,
                                              sizeof(touch_report));
                if (ret < 0)
                {
                    hid_touch_state = HID_STATE_IDLE;
                }
            }
            else if (raw_pressed && (hid_touch_state == HID_STATE_IDLE))
            {
                rt_int32_t dx = raw_x - filtered_x;
                rt_int32_t dy = raw_y - filtered_y;
                if ((dx < 0) || (dy < 0))
                {
                    dx = (dx < 0) ? -dx : dx;
                    dy = (dy < 0) ? -dy : dy;
                }
                if ((dx >= USB_TOUCH_JITTER_PIXELS) || (dy >= USB_TOUCH_JITTER_PIXELS))
                {
                    filtered_x = raw_x;
                    filtered_y = raw_y;

                    rt_int32_t map_x = filtered_x;
                    rt_int32_t map_y = filtered_y;

                    usb_touch_get_src_max(&src_max_x, &src_max_y);

                    touch_report.tip_inrange = 0x03;
                    touch_report.x = usb_touch_scale_coord(map_x, src_max_x, USB_TOUCH_LOGICAL_MAX_X);
                    touch_report.y = usb_touch_scale_coord(map_y, src_max_y, USB_TOUCH_LOGICAL_MAX_Y);
                    touch_report.contact_count = 1;

                    hid_touch_state = HID_STATE_BUSY;
                    int ret = usbd_ep_start_write(USB_DISPLAY_BUSID,
                                                  HID_TOUCH_IN_EP,
                                                  (uint8_t *)&touch_report,
                                                  sizeof(touch_report));
                    if (ret < 0)
                    {
                        hid_touch_state = HID_STATE_IDLE;
                    }
                }
            }
        }

        last_raw_pressed = raw_pressed;
        last_raw_x = raw_x;
        last_raw_y = raw_y;

        rt_thread_mdelay(USB_TOUCH_POLL_MS);
    }
}

