RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_CherryUSB/Edgi_Talk_Extend_Screen/applications/usb_display/usb_display.c
/* ---------- Frame pool (double buffering) ---------- */
static struct usbd_interface intf0;
static struct usbd_interface intf1;
static struct usbd_display_frame frame_pool[1];

CY_SECTION(".cy_gpu_buf") USB_MEM_ALIGNX
static uint8_t usb_display_rx_buffer[1][USB_DISPLAY_RX_FRAME_BYTES];

CY_SECTION(".cy_gpu_buf") USB_MEM_ALIGNX
static uint8_t usb_display_gpu_buffers[2][USB_DISPLAY_GPU_FRAME_BYTES];

/* ---------- Frame rendering helpers ---------- */

struct usbd_disp_frame_header {
    uint16_t crc16;
    uint8_t type;
    uint8_t cmd;
    uint16_t x;
    uint16_t y;
    uint16_t width;
    uint16_t height;
    uint32_t frame_id : 10;
    uint32_t payload_total : 22;
} __PACKED;

rt_inline uint32_t usb_display_min_u32(uint32_t a, uint32_t b)
{
    return (a < b) ? a : b;
}

/**
 * The usbd_display driver delivers a raw frame in frame_buf with a
 * usbd_disp_frame_header at offset 0. The actual pixel payload starts
 * after the header (16 bytes). We need to parse the header to get
 * offset info and copy the pixels into the LCD framebuffer.
 *
 * For simplicity we copy the entire payload (after header) linearly
 * into the LCD framebuffer with stride handling.
 */
static void usb_display_render_frame(struct usbd_display_frame *frame)
{
    if ((framebuffer == RT_NULL) || (frame == RT_NULL))
    {
        return;
    }

    /*
     * Frame buffer layout from usbd_display:
     *   [0..15]   : usbd_disp_frame_header (16 bytes)
     *   [16..end] : pixel payload
     *
     * frame->frame_size = header->payload_total (total pixel bytes)
     * frame->frame_format = header->type (RGB565, etc.)
     */
    const struct usbd_disp_frame_header *header = (const struct usbd_disp_frame_header *)frame->frame_buf;
    uint32_t header_size = 16U; /* sizeof(usbd_disp_frame_header) */
    uint8_t *payload = frame->frame_buf + header_size;
    uint32_t payload_len = frame->frame_size;

    if (payload_len == 0U)
    {
        return;
    }

    uint16_t src_x = header->x;
    uint16_t src_y = header->y;
    uint16_t src_w = header->width;
    uint16_t src_h = header->height;

    if ((src_w == 0U) || (src_h == 0U))
    {
        src_w = usb_frame_width;
        src_h = usb_frame_height;
        src_x = 0U;
        src_y = 0U;
    }

    if ((src_x >= usb_frame_width) || (src_y >= usb_frame_height))
    {
        return;
    }

    uint32_t max_w = usb_frame_width - src_x;
    uint32_t max_h = usb_frame_height - src_y;
    uint32_t copy_w = usb_display_min_u32(src_w, max_w);
    uint32_t copy_h = usb_display_min_u32(src_h, max_h);

    uint32_t line_bytes = ((uint32_t)src_w) * 2U;
    uint32_t copy_line_bytes = ((uint32_t)copy_w) * 2U;
    if (line_bytes == 0U)
    {
        return;
    }

    uint32_t available_lines = payload_len / line_bytes;
    if (available_lines < copy_h)
    {
        copy_h = available_lines;
    }

    for (uint32_t y = 0; y < copy_h; y++)
    {
        uint8_t *dst = framebuffer + ((src_y + y) * fb_stride_bytes) + ((uint32_t)src_x * 2U);
        uint8_t *src = payload + (y * line_bytes);
        memcpy(dst, src, copy_line_bytes);
    }
}

static void usb_display_swap_buffers(void)
{
    uint8_t *tmp = gpu_draw_buffer;
    gpu_draw_buffer = gpu_present_buffer;
    gpu_present_buffer = tmp;
    framebuffer = gpu_draw_buffer;
}

static void usb_display_present_draw_buffer(void)
{
    cy_en_gfx_status_t status;

    if (!pending_frame_valid || (gpu_draw_buffer == RT_NULL))
    {
        return;
    }

    status = Cy_GFXSS_Set_FrameBuffer(gfxbase, (uint32_t *)gpu_draw_buffer, &usb_display_gfx_context);
    if (status != CY_GFX_SUCCESS)
    {
        USB_DISPLAY_LOG("usb_display: Cy_GFXSS_Set_FrameBuffer failed: %u\r\n", status);
        return;
    }

    usb_display_swap_buffers();
    /* Keep draw buffer coherent for partial updates of the next frame. */
    memcpy(gpu_draw_buffer, gpu_present_buffer, USB_DISPLAY_GPU_FRAME_BYTES);
    pending_frame_valid = RT_FALSE;
}

/* ---------- Display thread ---------- */
static void usb_display_thread_entry(void *parameter)
{
    (void)parameter;
    struct usbd_display_frame *frame;
    const struct usbd_disp_frame_header *header;
    int ret;
    rt_tick_t wait_ticks = RT_TICK_PER_SECOND / 20;

    if (wait_ticks == 0)
    {
        wait_ticks = 1;
    }

    while (1)
    {
        ret = usbd_display_dequeue(&frame, wait_ticks);
        if (ret < 0)
        {
            if (pending_frame_valid)
            {
                rt_tick_t now = rt_tick_get();
                if ((now - pending_last_tick) >= wait_ticks)
                {
                    usb_display_present_draw_buffer();
                }
            }
            continue;
        }

        // USB_DISPLAY_LOG("frame type: %u, frame size %u\r\n", frame->frame_format, frame->frame_size);

        header = (const struct usbd_disp_frame_header *)frame->frame_buf;
        if (pending_frame_valid && (header->frame_id != pending_frame_id))
        {
            usb_display_present_draw_buffer();
        }

        if (!pending_frame_valid)
        {
            pending_frame_valid = RT_TRUE;
            pending_frame_id = header->frame_id;
        }
        pending_last_tick = rt_tick_get();

        /* Render to LCD framebuffer */
        usb_display_render_frame(frame);

        /* FPS tracking */
        gui_frame_count++;
        if (gui_fps_last_tick == 0)
        {
            gui_fps_last_tick = rt_tick_get();
            gui_frame_count_last = gui_frame_count;
        }
        else
        {
            rt_tick_t now = rt_tick_get();
            rt_tick_t delta = now - gui_fps_last_tick;
            if (delta >= (RT_TICK_PER_SECOND * 5U))
            {
                uint32_t frames = gui_frame_count - gui_frame_count_last;
                uint32_t fps_x100 = (frames * 100U * RT_TICK_PER_SECOND) / delta;
                USB_DISPLAY_LOG("lcd: fps=%u.%02u (%u frames/%u ticks)\r\n",
                                fps_x100 / 100U,
                                fps_x100 % 100U,
                                frames,
                                delta);
                gui_fps_last_tick = now;
                gui_frame_count_last = gui_frame_count;
            }
        }

        /* Return frame buffer to the pool */
        usbd_display_enqueue(frame);
    }
}

/* ---------- Init ---------- */
int usb_display_init(void)
{
    uintptr_t reg_base = (uintptr_t)USBHS_BASE;
    cy_en_gfx_status_t status;

    pending_frame_valid = RT_FALSE;
    pending_frame_id = 0U;
    pending_last_tick = 0U;

    usb_frame_width = USB_DISPLAY_MAX_WIDTH;
    usb_frame_height = USB_DISPLAY_MAX_HEIGHT;
    fb_stride_bytes = USB_DISPLAY_FB_STRIDE_BYTES;

    gpu_present_buffer = usb_display_gpu_buffers[0];
    gpu_draw_buffer = usb_display_gpu_buffers[1];
    framebuffer = gpu_draw_buffer;

