RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_CherryUSB/Edgi_Talk_Extend_Screen/applications/usb_display/usb_display.c
    rt_memset(gpu_present_buffer, 0x00, USB_DISPLAY_GPU_FRAME_BYTES);
    rt_memset(gpu_draw_buffer, 0x00, USB_DISPLAY_GPU_FRAME_BYTES);

    if (usb_display_hw_init() != RT_EOK)
    {
        USB_DISPLAY_LOG("usb_display: display hw init failed\r\n");
        return -RT_ERROR;
    }

    status = Cy_GFXSS_Set_FrameBuffer(gfxbase, (uint32_t *)gpu_present_buffer, &usb_display_gfx_context);
    if (status != CY_GFX_SUCCESS)
    {
        USB_DISPLAY_LOG("usb_display: Cy_GFXSS_Set_FrameBuffer init failed: %u\r\n", status);
    }

    USB_DISPLAY_LOG("usb_display: Cy_GFXSS mode, src %ux%u, stride=%u, present=%p draw=%p\r\n",
                    usb_frame_width,
                    usb_frame_height,
                    fb_stride_bytes,
                    gpu_present_buffer,
                    gpu_draw_buffer);

    /* Init frame pool (double buffering) */
    frame_pool[0].frame_buf = usb_display_rx_buffer[0];
    frame_pool[0].frame_bufsize = USB_DISPLAY_RX_FRAME_BYTES;

    /* Register USB display device */
    usbd_desc_register(USB_DISPLAY_BUSID, &display_descriptor);
    usbd_add_interface(USB_DISPLAY_BUSID, usbd_display_init_intf(&intf0, DISPLAY_OUT_EP, DISPLAY_IN_EP, frame_pool, 1));
    usbd_add_interface(USB_DISPLAY_BUSID, usbd_hid_init_intf(USB_DISPLAY_BUSID, &intf1, hid_touch_report_desc, HID_TOUCH_REPORT_DESC_SIZE));
    usbd_add_endpoint(USB_DISPLAY_BUSID, &hid_in_ep);
    usbd_initialize(USB_DISPLAY_BUSID, reg_base, usbd_event_handler);

    /* Create display processing thread after mempool is ready */
    display_thread = rt_thread_create("usbdisp", usb_display_thread_entry, RT_NULL, 4096, 12, 10);
    if (display_thread == RT_NULL)
    {
        USB_DISPLAY_LOG("usb_display: create thread failed\n");
        return -RT_ERROR;
    }
    rt_thread_startup(display_thread);

    if (usb_touch_open_device() == RT_EOK)
    {
        touch_thread = rt_thread_create("usbtch", usb_touch_thread_entry, RT_NULL, 2048, 13, 10);
        if (touch_thread == RT_NULL)
        {
            USB_DISPLAY_LOG("usb_touch: create thread failed\r\n");
        }
        else
        {
            rt_thread_startup(touch_thread);
        }
    }

    USB_DISPLAY_LOG("usb_display: initialized with usbd_display driver\r\n");
    return RT_EOK;
}
